[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
14159
17335
11298
6517
1526
11374
17745
19426
14632
2085
16970
3587
10323
17438
985
13472
21183
10996
9740
18915
4300
9595
8361
8121
6561
524
16328
3467
18863
563
17395
16823
17944
17000
10105
6298
11882
15873
9221
18561
5687
11287
19433
20414
13973
2784
13291
5154
12043
6102
20812
15386
14388
11912
16194
11920
15000
2414
430
7510
14873
8572
6958
12462
1679
14895
5786
18405
4205
12048
12604
2187
5242
7055
7727
9777
2909
10793
9472
7471
13215
3337
17538
13065
18771
14408
20555
7559
11559
687
16445
19391
20036
9034
16156
20221
16345
3825
9313
17865
4256
17482
14077
17198
9231
17647
7215
7468
16774
11456
13897
18877
6560
9325
12359
16603
3883
2684
15104
19356
10592
18954
2929
8580
12603
1843
17504
9396
7623
12658
18022
9845
3696
15650
9314
15858
16691
11389
7588
3131
16064
5123
19296
20954
9322
17162
6796
12386
18282
2103
6398
320
3766
12648
9725
10907
11131
2295
20617
2288
3951
17164
18830
18293
19972
6803
10949
2272
6230
14116
13511
6228
15741
5666
2733
19357
9781
10707
17165
8406
18702
13892
12846
17972
3349
9082
4655
1973
17719
5816
11570
9803
1820
2528
1931
5341
4354
3293
20063
19697
11265
19415
9816
18118
21101
11947
6758
7164
13382
4024
2162
17003
14275
16244
15701
11203
3436
1705
7268
19833
12621
883
5040
21009
12184
4042
14249
9032
18136
8347
8614
17914
8466
15493
8372
6480
2200
18321
19514
10104
19738
9072
4404
13699
20706
2378
6994
16501
161
19587
8674
1672
10605
17257
3892
2856
7168
4086
16924
12762
20297
1133
16224
6118
6420
1892
18036
14616
15859
5303
8765
4608
778
12868
20648
12609
3929
8933
15726
345
2625
5795
4071
15454
7075
9278
16014
5596
3441
18171
11178
15299
9630
10052
4204
18548
2258
12783
3010
10659
8262
18170
10609
17304
9380
5535
6563
7157
10090
10570
6731
5443
18881
17503
20188
12141
16857
20728
3723
11631
9142
14248
19734
17874
13190
18876
13092
3833
7973
19835
7776
6139
13153
11809
1415
14195
13618
15918
5310
15946
17458
10877
11040
2967
5599
13192
12316
9718
11216
19169
9893
20389
16760
2136
15933
4872
4538
13002
19075
8052
2052
11527
16476
7805
15377
14323
9323
18687
20697
2269
8390
13251
12953
5977
9351
16349
223
19954
14229
2138
18886
10136
2594
15663
15684
8712
15273
5488
9395
9043
5318
8126
7003
14103
4449
3809
3567
11405
12167
20678
7937
6126
17012
16604
2780
18274
12734
3876
11205
1211
10952
14547
1510
16118
16995
15109
2747
9596
5637
7611
2777
11785
4584
4128
7565
462
13439
1869
12831
10563
5765
9527
19503
10405
4286
2745
16447
4127
16451
3195
2443
10929
18351
5251
17488
11425
15405
4346
15415
4457
5992
10785
16087
12542
16290
15912
7662
6805
12665
15143
18109
10666
2888
8237
12712
11035
14431
5322
1368
19201
18490
10951
4036
1656
14043
16041
10162
9006
1798
3018
2190
15446
7475
18758
3507
12906
9755
14482
10148
15020
14944
483
3705
9388
458
16239
16665
11868
102
16143
3902
21008
6845
8875
17348
17878
8282
19768
14663
10102
13337
16769
15094
681
20318
7050
12539
19083
20012
2059
457
10607
18084
8578
3052
1982
9857
20719
15636
7410
15554
18777
12443
20770
3419
14483
15412
14591
19566
10261
251
6167
6260
21057
1894
14378
10750
18101
4257
5653
13438
2353
7949
11621
14337
20925
18679
10146
9461
19042
4762
19092
19370
11501
18682
1042
16640
8829
7518
1404
17468
591
17371
16840
9529
8132
5473
3716
2395
4459
4669
6838
19405
17280
17957
3874
18328
15183
20388
21095
17376
14497
21118
17064
19132
8114
1258
15481
9150
15988
19320
18873
19052
15526
1478
13807
16051
11949
9170
17920
12939
3201
10612
5163
456
12123
16652
3650
308
3154
2151
13466
17720
13269
7961
11147
8828
17943
12530
887
11290
15959
18926
13616
5179
15290
4781
20613
12099
14185
11412
19657
470
10066
8310
21154
12001
6098
2357
20674
13464
19703
18818
14627
11495
9986
4496
7377
13535
2256
14042
16422
15298
1364
14880
3944
7995
19611
1294
6763
18890
10697
17025
11593
4391
4452
17318
20033
13161
165
2276
8552
803
17576
18591
13580
10927
8567
7217
10396
1361
3409
12401
11004
8364
9870
8487
12131
7235
1959
14495
20508
7082
7724
19897
3972
1866
1929
18779
20643
2912
9244
3798
5426
6067
19096
8058
19134
13717
1726
9946
9907
5034
20829
20803
12801
5052
10604
13654
10467
17061
11853
7333
7226
10211
6719
10790
14617
7160
8869
12456
12817
19209
5141
17866
19997
19309
15568
14287
16303
16372
18135
10629
18499
570
15476
8397
10833
15573
11390
18600
4857
5320
12782
2514
3305
12644
1674
13635
5130
19518
7546
16735
19672
20710
2996
11496
3482
7361
4073
7229
16392
7802
14903
4040
3263
12511
8477
1345
15297
13545
13363
7120
17237
11415
4151
19601
12721
14023
8256
8435
12640
7789
6287
18963
8154
15005
5236
13355
16646
10249
4414
19582
20473
10247
9417
19302
10368
16956
1908
7855
10274
16375
1980
13383
11595
13715
20866
8168
15665
18373
577
1812
16225
11023
16206
1518
18487
12933
6952
4443
13677
16827
21147
9635
13903
5533
12320
15227
11645
15400
14174
16105
15208
16158
14343
19340
15181
16212
680
11781
4694
9184
19013
18764
3396
10257
9275
15052
11822
6920
13583
9830
12434
7016
17187
18366
11938
4647
6812
19002
973
5744
5465
20653
11335
5506
20776
9750
16639
764
15026
19276
16623
12612
19677
1370
1484
14046
17890
14258
17544
9011
11344
6762
14920
2759
14060
18478
17542
927
7739
9089
2893
18127
20676
15116
13875
4680
5355
13025
5593
16056
1134
19921
10966
3718
18399
3481
14095
3356
2930
14065
17291
18464
14338
1659
15977
17401
11052
12122
5048
10234
5124
11230
10621
1920
16793
13228
3857
2722
13400
1544
3245
4475
19911
10798
10641
11921
19747
19778
7537
9498
11451
1118
16660
7723
12431
10072
9484
15293
6444
1848
17215
11129
3518
6688
19743
2167
7006
1256
14466
2727
19380
1624
4643
1093
15175
5049
1673
11748
14301
13125
19728
19465
10509
5466
868
1594
3401
16611
8948
16834
12519
12029
4566
18257
7992
2370
15118
5422
15553
8189
16260
10181
289
12854
20277
2347
12203
5326
7045
10860
7553
13123
13490
225
7624
924
17412
2520
8499
14624
10837
12568
2274
3934
8987
1350
7905
14788
16765
8842
19505
7519
625
5846
14755
15755
20427
8152
10458
16778
5758
18658
6441
87
6361
6697
18969
528
12220
19872
14371
13345
21025
19100
7126
17826
13873
32
15137
14521
1180
17138
10188
10967
15712
18376
5260
21033
19935
159
15125
4753
7096
18389
4663
19368
7764
12765
8957
13479
20800
13914
9355
2988
4847
19689
18570
9977
4322
18398
15510
4551
383
11637
14745
19105
611
4959
13727
10024
380
2971
12848
2448
18902
8942
18498
17028
19706
1372
12152
19652
20483
16992
7027
20276
13250
124
5245
3710
12821
580
1871
15949
20156
6423
5704
18665
20125
1703
9567
10057
12865
777
20970
391
5981
20679
11538
7202
10795
4251
21192
10569
8555
12444
10925
17965
5953
1066
9838
1978
17953
11933
17365
2822
1733
7942
16766
21028
21069
2069
4009
10272
10577
6687
11472
7695
20838
14965
6533
11604
6019
16277
16228
9859
8335
18103
17707
7032
19525
15823
10109
5293
11836
17694
17786
417
4989
1806
2820
2275
5347
362
8373
6860
20978
632
1203
1479
11840
763
12952
2935
13293
13801
14290
4792
2005
19225
13708
3846
4307
4312
6403
4136
19934
2567
20777
3246
15093
5218
11689
545
312
7684
9853
4851
1450
18632
19068
19358
20271
19409
12337
8767
11696
6552
12651
13638
2336
16114
6327
2201
6919
5156
8280
19678
876
16397
8200
10876
19154
10994
12183
2089
8293
14375
8375
8247
17757
6808
16174
17532
21189
15936
5829
3129
16362
11716
4289
10521
20181
8846
19750
1029
4939
3001
15149
18888
8615
10737
1784
4948
6238
20856
3938
18364
11478
8115
15041
3524
19968
7747
7169
15503
16799
7117
1529
9768
16879
15186
2710
14628
17088
3181
18701
15898
20652
17018
4327
15956
20484
17180
5545
9459
6347
8000
15943
15591
18647
15544
14756
12536
7972
6998
20979
1743
6503
13888
8388
15515
833
8020
14551
6249
6564
1112
7563
11627
12725
11854
15576
18550
7997
19285
7483
5617
3499
17253
5117
18063
9955
13493
1722
4384
19094
3690
12919
4611
19359
15724
14816
19270
7633
17913
9139
233
9503
12094
327
8279
14059
20410
8920
6782
11518
3304
3061
650
20733
21044
9022
18511
9446
9202
16380
974
12477
5649
1229
20736
474
12179
10814
15697
861
11342
7637
9880
15491
294
18013
3620
2937
7700
17975
10684
19785
12305
10510
12559
1102
6969
18039
5376
13335
15261
5173
5866
7194
13170
8430
5420
9084
17764
15995
16163
13809
14237
20015
18173
10231
9722
20564
3448
16233
19841
1499
11563
8792
7873
17434
18419
17174
19539
13434
7787
15965
4077
19631
6213
18393
8085
14851
10937
12058
678
19756
19888
3096
21160
664
16768
8823
14469
1668
6843
8323
12523
4183
15676
1718
1610
3447
8690
3928
3843
17479
11894
20143
8101
7004
788
4250
15836
17391
4688
17360
2405
19145
1461
672
11242
83
5492
2748
16067
12883
447
1154
17809
6396
8680
6345
1424
19906
5713
6227
1823
3767
20618
12344
7463
19990
1815
5739
11683
20645
4690
17423
3171
837
11738
14666
8549
12023
12987
14826
18669
6659
15214
12030
21132
12364
14730
16300
7035
18991
12525
21043
8155
6669
16428
4689
3631
14152
2300
11307
19608
12429
8834
20249
18251
18700
6084
15921
12390
2279
19963
1124
15511
20532
11687
4704
337
15756
7699
9058
8093
14604
1263
12210
14476
1905
9919
16772
5311
1192
283
10775
19815
4764
7293
4692
4070
16975
17154
14467
12248
11410
13147
19223
20760
351
9745
15462
10212
18778
3658
7843
12888
12818
12546
3051
20393
13846
20503
918
11310
16458
2913
2030
1687
4125
11149
2923
3923
9111
13870
3715
14146
18201
16897
12541
9059
17373
17004
3639
9698
14047
10431
19603
7034
14987
6831
19178
14074
20868
3904
16470
17705
17300
15733
6450
8404
13709
17496
1644
8068
2060
850
2689
13643
10717
19280
424
16032
2814
6414
7414
13845
11215
2057
11351
10935
5495
12660
13640
2137
7444
15854
12124
8745
17838
18185
4278
15270
3619
14226
20451
9927
3170
14742
2403
1999
6598
9478
18012
1861
7917
15734
12056
1582
6078
10496
11255
834
2255
7825
16841
18168
17636
18222
16750
18424
17628
4929
4933
2688
919
7339
12485
15655
4928
12878
9751
2337
12380
12564
18117
4652
16411
9574
19894
6983
16486
2434
10645
8636
4155
18019
9975
8546
7987
4564
7488
8789
15586
9535
9982
469
6764
7788
18655
10469
9208
18065
11051
8475
16927
11996
9376
3334
917
4791
20372
17850
992
4735
5661
13115
14316
17820
3374
2645
1637
1838
3298
14087
12786
5663
9469
2941
19256
17476
1366
18072
12505
11910
1179
6640
8649
8271
11269
744
463
3286
9426
7647
1177
14170
16733
13452
14006
3722
17448
4406
21155
13156
7288
13972
7490
4716
14321
1470
6279
5031
11026
20386
704
2442
512
7058
2332
16635
4776
5232
491
4419
14821
14911
7584
1033
17776
12252
20634
7539
19655
6467
2045
20716
16253
5587
3214
6388
19862
1779
419
285
12573
19011
4495
2084
12433
5127
11939
7121
1638
884
6355
12128
19451
3621
448
8535
14391
19466
10674
8836
3111
8366
515
9962
2017
20158
5113
17574
14702
2622
6801
20296
10354
17921
20311
12991
17202
8793
14484
20476
11358
2511
19091
369
19109
14824
19454
766
6637
9213
11898
18069
14812
2818
13222
8904
16843
11859
9049
18728
5842
20235
10567
11062
8204
10067
19538
20694
11370
743
4754
21065
2090
5361
8283
17928
15219
8994
6406
15686
6864
1410
7879
17604
17136
16522
17455
4097
6153
17853
2847
20421
7955
5538
18941
16030
506
18361
1831
5471
16387
17862
21084
10344
10830
14589
14416
1910
3580
19532
6183
2322
12723
10590
920
5575
17241
1876
15825
1079
7282
8436
11214
521
9633
11017
6506
19513
20911
16325
12300
13072
11790
3227
18512
14300
19729
7329
6297
12768
17043
4759
12893
7606
7931
12468
10724
12980
19752
3634
1765
244
15807
21045
18722
19710
14808
5947
12614
10732
4805
3967
1405
6940
8902
6816
13238
12526
18346
21136
1199
12913
12240
18007
16200
2424
13707
259
19666
8782
2790
8377
20151
7945
5767
18666
1157
2416
10900
15799
12041
1028
19018
84
20935
8245
13494
12802
17235
17561
6716
14997
8439
5983
12303
1259
20950
14776
14958
10404
9495
16202
18901
20088
15584
9865
372
7182
3920
6360
13076
11121
10853
13021
13417
15193
7713
18783
9673
12859
7745
85
5153
4083
15338
10128
19089
17637
16320
18375
18467
14532
8907
15780
14619
2956
3114
1401
20952
6081
2621
9660
10303
19446
4684
9070
3847
8133
9444
14422
2270
15345
15574
9339
19470
9524
8639
15851
9746
2035
16203
16685
6768
10841
119
8514
2179
14176
4008
1571
11540
13210
5937
6921
17763
18924
8533
8384
14685
16136
11673
6739
2376
14901
2501
18394
17355
9658
2239
11675
19711
3697
5987
13280
6164
4245
15272
10317
3693
12036
16352
13376
808
8825
15162
12822
10203
9773
17539
10984
3837
14573
11580
11725
9631
8438
7387
9357
10956
6108
15038
2600
19264
2633
5720
4005
8785
6610
9709
14475
1928
12222
4031
16138
17529
901
5286
2400
16394
19211
412
17015
20646
19784
1122
12562
11959
19491
12550
4295
9465
4219
1554
1585
4316
8188
16482
4905
8044
19230
1145
20355
9742
3536
421
18406
7625
3822
16978
8457
3009
15204
1056
3713
1935
10822
5283
20959
11153
1662
19772
14677
11263
15556
15315
878
12777
19026
12298
11546
18234
3254
10883
16259
8610
18347
8998
17279
16964
14410
4409
6166
15039
13720
1104
13084
16149
4705
12071
15658
15981
20232
5306
6936
11416
3306
10884
9044
14333
11438
15698
19530
6114
8095
14519
8513
15500
7342
481
20702
18280
19360
15487
3563
2140
19951
1692
11618
16519
20225
14082
21098
7830
20457
16563
1290
12104
7334
17112
19562
14688
4149
3725
14107
19151
10543
3659
14050
18236
3975
4172
5851
19101
17
14401
17224
20955
17442
1298
15484
21120
7702
20692
13872
7791
17071
17724
13207
13761
5863
2154
10171
17036
12684
6020
13917
13589
17804
17903
18493
5614
4107
20365
806
19669
9788
6783
979
20253
10637
10840
11698
16620
3469
17775
956
1778
17512
8163
8643
11676
3512
12717
5126
2316
14815
8136
19298
19685
20720
15505
10829
16510
9828
357
19173
3312
17211
5761
5024
9289
2672
20980
7480
12652
17547
9874
15494
9045
1951
2933
5290
11036
10639
5732
11454
16371
11196
13256
20582
20867
18740
16465
12636
2437
769
4047
11726
16851
9441
5094
13555
20154
12315
8619
15971
12567
13008
12204
4121
18831
2904
1427
3608
11710
6791
14750
15051
4799
19115
19144
246
14171
10101
13350
6180
8433
14894
5343
12226
2344
15562
18808
6435
8108
3897
1017
14381
11109
6258
19450
6340
7627
3102
3914
19428
5530
1561
15071
2305
18031
263
6915
4513
16609
15274
13183
12700
3067
18225
866
2341
11557
8354
10665
7564
20110
6963
9413
63
12004
20815
19012
14428
18025
17620
10591
12872
66
20178
20599
17761
14412
12028
20537
11225
1805
7090
9175
3853
10345
9549
14635
21125
19956
13625
20344
16599
15729
18226
21039
4947
19328
9571
13163
10081
4324
8291
9533
6693
6371
4748
19311
19331
10420
11485
1826
4661
3501
1923
3421
5789
9386
718
1041
13265
21186
19602
1817
13644
12147
15486
20195
9099
5328
12992
15373
13781
18378
15776
17770
6262
20223
12532
9657
508
10131
7446
19216
15618
2879
1141
4193
3445
535
2444
1106
10184
19929
19155
5708
19171
15850
20620
7346
6478
16092
6948
15930
11810
7927
7835
15683
17684
7641
197
4084
14737
8604
12111
7135
6684
5832
6007
17626
1101
15785
6170
3899
19255
7093
13141
11401
6699
3516
3572
13632
466
16888
12976
10178
631
18423
7317
15160
610
8232
13003
16767
14112
6962
15249
10760
16464
17433
3535
17808
6302
10010
20267
6953
19269
20194
18097
12747
20853
20400
14798
1691
11845
7728
6775
15450
15653
4836
15060
20602
551
12024
2445
3036
10282
16198
15383
11598
19293
947
3132
142
15580
4165
17195
7935
6574
4302
6601
16692
19034
493
9164
1058
15387
3956
666
12361
20351
302
20037
13060
18006
5015
5647
7331
14464
9724
167
7896
19988
15585
16432
11037
16024
3165
16106
6996
614
8800
1921
8106
8940
2585
12207
9809
19135
8864
20162
14656
7141
1360
15822
9219
147
8450
907
8109
865
11281
6557
12967
10439
18826
12820
7295
8666
13070
11596
9180
17987
2146
19286
10537
15848
11029
20627
14777
8467
20017
12931
12368
12758
16442
11802
16195
17702
15339
11359
8991
18997
11727
9924
10401
3795
12769
18216
12006
6671
19982
10788
3629
11170
15074
5101
5665
16741
4429
17892
10664
7938
8255
3172
1309
8837
9552
10915
19744
5093
20001
1176
18043
15552
17143
1489
10673
20585
13836
19119
16524
3327
14271
2165
2099
5784
3764
16111
14983
2228
4064
15057
17413
5702
3738
11448
16699
388
16939
16145
8596
10923
6512
19948
6103
4623
5460
11083
2458
68
10522
3628
8918
10058
16045
3468
2657
4383
18439
15631
21126
3754
3257
1545
16951
16050
17712
4235
6813
8808
10463
18663
1013
4840
5980
13867
6815
16033
20367
6653
10873
5991
2324
5100
8755
16673
7144
10698
10311
11084
7014
8795
16197
14950
2541
1753
13820
13876
13649
10734
10855
2003
20795
6181
10309
17876
5077
13411
21119
1874
8988
2769
9593
1950
7595
2873
13759
15294
10708
4412
14453
804
5660
19540
3475
11857
11989
18231
16180
9336
3345
18252
20541
18348
10371
15042
19140
13262
8624
990
1547
9576
21180
19339
7223
7007
3086
5225
9370
6082
2998
20273
7123
2715
1825
829
15945
6030
2206
13285
6138
2694
11399
9081
1570
18537
3459
11517
19865
18455
4898
9556
15221
160
12827
17506
12548
8004
11758
21217
16592
16333
18119
10115
10363
15635
8066
8161
10906
20845
1147
11658
15975
9153
6755
15608
10530
17886
13482
7737
3134
17058
7512
5743
6961
3504
20780
4728
11864
14814
18333
6846
2132
18557
1899
14620
7320
14177
8254
8349
16490
725
21096
7177
20306
3461
8289
2917
4247
15490
13547
10556
15507
9467
9247
1105
9056
18470
1666
2767
7392
13913
13712
4337
7614
2408
1396
13328
19066
9811
19598
11807
272
20044
15066
8411
10284
6970
6433
3946
5430
18010
19221
8385
6568
8798
5505
11423
5619
12863
14187
2640
7211
19751
18743
17591
4270
6150
11511
15117
7817
13232
1932
8001
16850
19549
14328
11210
5387
1376
11380
13945
11490
11295
5878
19933
3663
8042
17516
5190
5926
print('modelName:',self.modelName)
13576
10985
20536
16020
9563
7577
5519
21159
20556
10199
14352
9485
20655
14493
9237
12894
4310
21130
15794
20321
1046
17569
20089
8357
1128
17144
8635
8531
8510
13184
14367
11919
4372
5696
15692
8344
20332
17115
13974
4425
16235
5301
20791
18322
16444
1026
12948
11978
11998
5946
11219
13935
12580
8327
2431
9906
2549
4632
20390
4568
16190
8835
5994
7484
4446
13451
13500
7615
7243
11524
15397
19289
8389
12643
2661
4001
4373
14310
19168
1694
14021
18179
14468
2483
5339
207
13214
16633
1059
13158
16074
3877
15947
10388
5740
17893
7708
10711
17167
10597
7089
542
4491
17825
164
4211
16783
14342
11266
7420
7148
10993
7140
13776
15617
7376
11895
2023
4420
16295
17256
3836
9432
14363
7459
18157
16872
3032
16875
6269
13463
7628
16889
12452
3692
7159
18056
4935
2898
5373
6528
5222
9868
11812
16159
1142
14359
1310
190
8355
10794
1197
16661
13152
10615
15616
18404
18634
20533
15473
16770
18891
5779
1742
18649
2433
2678
20144
18595
15642
17606
12489
18028
14149
9425
9071
3384
3676
9117
19658
14833
4147
5679
1435
8622
16062
10751
18239
7851
8222
20394
2975
11471
2529
20437
15007
405
17782
18479
3465
3647
16270
9887
19167
7464
3120
1709
19523
17085
1538
6991
14593
1061
16870
519
5664
10546
5985
2578
13837
13120
8401
14613
13985
7197
5975
4143
12166
18265
688
1952
13957
20831
14432
1439
4532
17602
9670
1182
18621
2861
2568
15644
1938
366
17301
6751
12170
19319
11373
7292
14215
9420
16900
6008
3947
19907
9796
348
1671
12201
3270
531
1533
14561
1618
9054
117
8740
10268
14925
703
7929
16187
12474
13657
2658
19758
3741
10170
16273
17909
11054
10696
10647
14232
12923
19654
3425
1003
7396
4493
14749
5770
4923
3488
12324
10767
14500
9091
8916
13316
3485
4259
6352
14030
7388
19032
8292
20182
2308
19156
5258
12224
18218
5383
16443
9825
9836
13137
20095
13202
1665
8030
9996
11339
10880
9591
16214
11828
1847
8482
18597
13585
16132
13475
11461
20756
792
17527
1329
4106
4626
639
2340
4970
19111
16077
20136
6189
20052
10195
21209
16351
10472
17555
18871
13889
15350
1130
16019
19898
17350
4433
20229
13962
7152
909
17051
20616
9753
15407
17077
16806
10962
13471
6569
4464
5824
13981
112
10436
10076
4588
5162
4214
3458
7528
12825
5187
15524
18048
15331
8179
5707
13855
16586
19232
1184
4455
17298
17203
5107
16031
20786
16982
1766
16184
19957
12125
3326
9203
19932
7101
9116
890
16686
5030
11581
13447
11735
14346
19057
19203
12033
18965
6631
6257
10054
13164
18488
15191
5231
9362
10001
7977
19916
8598
18814
6818
19958
20299
8368
532
140
2655
2241
10825
8551
9443
3549
18694
13012
17409
11625
5908
5932
11285
21139
17844
11955
6010
1421
881
2141
19047
19910
18128
16339
12263
11908
549
11741
10661
3777
9835
13258
2125
8660
14162
8125
9682
20560
15913
13428
13377
8557
14181
5503
13356
17130
4602
21172
9634
13443
3907
1842
20322
19696
1953
13315
9144
6443
10624
10123
4313
5515
14524
20836
2327
8529
11664
7385
5474
7833
20701
10683
5029
21076
5959
10578
7666
5270
2685
20884
6462
3370
3081
9648
11768
10011
221
5527
11132
12465
111
6502
17727
14024
12901
6317
9057
10219
11020
7617
10919
11773
3793
19488
11994
9211
19846
10756
7770
7643
19177
10974
10470
7608
1556
12411
8760
11141
6250
3470
7176
16906
11566
13744
5902
6303
5499
355
16895
7244
10053
8645
4375
11315
975
17787
137
14191
5719
13378
19198
6263
20819
20142
4029
8990
9639
17384
16061
7797
5559
228
1696
12959
5771
8527
2806
2936
7097
3228
19183
19838
2892
15870
1641
19486
2473
261
8936
14645
11893
4819
8230
3802
16791
8270
5901
3077
20703
4800
5999
5540
16731
856
15516
1248
12956
11277
21204
8273
1562
12409
16274
13705
12107
16740
3295
1943
13916
11682
5140
6141
17327
10047
7390
5532
14576
9801
20047
4839
5639
12387
3360
15761
14978
426
18095
5437
6425
11681
17507
8217
15606
5850
14072
3980
4638
16248
7382
12623
7064
10679
8969
1794
9987
8199
13884
4946
2261
12892
8064
1156
4521
8999
6099
10193
7688
17563
4765
2070
11837
10820
19434
15153
20139
4672
9262
9964
20382
19463
19043
11653
13693
13308
12358
14286
8444
1262
16115
18066
6822
6033
15727
7476
12236
19560
5085
9876
20342
1039
5069
13332
12398
17556
10208
1014
10034
20395
15710
1933
13224
10517
17099
3398
4850
11433
10134
11630
21038
5573
801
3359
19836
18576
14963
675
19417
5942
11572
1607
11162
4146
10095
4734
17864
7479
19142
5192
15609
19592
5518
20199
5082
6005
2259
11356
14186
13520
1523
12067
11536
18680
12082
10901
16818
7689
8151
17817
16571
13053
4731
3633
15704
19235
6100
15492
13495
12301
13810
15205
1323
20551
16907
8246
19556
16240
15519
14305
2880
17429
600
1340
6113
1447
19590
17421
20084
20611
5268
18578
8528
11133
7340
2714
15579
972
11267
822
14037
9554
21067
10026
9226
3878
17644
9875
9334
12106
16170
10028
11824
7104
1485
8190
9610
9645
13862
20166
15276
20252
15169
13716
13655
8822
13617
10071
18948
5364
18736
6162
20466
19580
10043
11588
9784
13724
16853
18086
4138
4677
13980
8173
14659
2092
13341
20972
980
6648
18341
2335
4445
18640
8845
1442
10704
5760
1750
2867
11643
18130
4605
8577
9489
7103
13022
10587
20441
6820
19902
17680
6161
7009
9341
3216
897
10169
3023
8911
12228
17379
4639
17331
796
17661
18645
13423
16764
10321
17023
12529
3720
11354
13882
19585
21015
19498
2703
17273
15572
9331
6334
18978
9530
11571
9439
361
7033
7834
14022
14567
3340
6894
11753
1498
4577
2296
3011
11419
6191
10912
21212
9068
17546
1077
16088
5615
10842
12871
10730
6883
10307
12310
6507
11641
16449
8504
3996
2482
17461
19321
8963
10346
13041
928
17142
1893
3981
11426
10280
18386
8207
12793
3408
673
6529
10780
12196
18400
1063
16044
2696
8251
19809
1006
6004
13468
14400
18953
11562
10498
14148
11469
17206
13130
2055
6062
15370
12408
18425
3994
4962
4308
3394
10856
20275
16373
16238
8794
17767
20039
103
4607
4320
6497
8691
15435
18832
2997
11186
1098
12334
1837
18100
19597
9291
18248
7224
5604
21193
11233
475
3118
20666
13848
16638
20302
1771
870
17916
18126
6390
5509
574
13760
5227
12856
359
8730
4267
17964
18266
1636
13015
7880
20445
14954
17863
3986
18469
8521
16364
21223
10099
18319
12150
15787
13398
10256
5726
1729
10144
15220
4437
8538
2198
4311
20290
20319
8964
10755
2118
8679
5484
15604
14051
2918
13543
554
19770
4411
21063
6364
440
1181
4170
7980
6246
18714
8537
9942
13313
15367
7048
6959
9083
5134
19104
9764
19039
9102
3161
5790
11528
17017
19362
15409
10536
11007
4053
10497
12815
1206
1593
7793
7913
14875
6946
14868
15601
8342
828
14758
2773
5186
2122
2321
20487
15958
6047
677
14392
4770
17656
6220
20265
18536
4200
8526
8923
2452
20248
13894
5898
13994
14451
8410
1717
10402
20112
1955
15166
2525
514
5904
15349
6906
14858
10289
16596
8805
11609
8371
6385
5514
19007
5309
1604
8949
15067
19878
12459
14379
5372
17137
14537
8056
16649
8215
20043
20734
10899
18410
3090
4861
12211
187
19318
10694
17236
18559
20693
14285
8775
5216
18191
522
7967
13480
5269
7889
15212
7357
18577
13648
7409
2266
3400
17607
13563
13710
18444
593
12595
19056
19226
6615
17117
8039
19072
10077
14015
20895
5921
8970
20538
7405
15018
15337
15711
3159
15922
11349
13134
11668
19268
19827
13958
15075
16133
13730
10464
14773
13959
15895
15966
19324
4565
20122
4893
2432
18483
6539
1219
16302
3496
18945
10037
12385
13365
9951
2608
2073
16336
9126
5630
7477
9063
10434
11231
19218
18187
18340
2795
15985
4242
8784
20021
5734
7911
18910
14856
2676
11185
17806
13669
12215
15952
12512
4096
18935
13561
5234
9483
17159
14994
3275
4737
4934
11333
20164
20737
7502
15953
20102
13844
14973
17634
8233
7060
13531
7983
19278
17713
19354
8608
17911
18070
14809
19550
1426
11752
2250
17715
18894
19512
10715
10301
2282
18870
19733
7687
19842
8862
18856
21175
11514
1884
17577
20135
7923
612
12249
9663
20279
6472
20268
1287
15810
16417
12484
11603
10819
3000
3602
12060
7189
1800
8360
16931
21138
3649
21035
8213
12787
9359
18318
12304
3266
19516
4341
11576
17153
14972
20090
17619
17601
18207
20346
15178
9983
15728
5806
19600
1688
17495
20161
6908
3015
5078
19236
16218
13537
19867
12335
5002
20191
14586
1292
12278
12458
11165
5542
16146
14835
10613
19087
3130
3427
1319
2397
10155
19857
2503
5840
18641
13270
19840
4807
14735
1285
20242
13061
1500
4158
11731
7129
13602
15173
16641
14759
11878
14317
19188
4065
21040
10588
4582
13399
18955
12779
8031
2674
18264
9938
17342
1667
13077
3291
23
3808
11876
11800
3188
11770
14292
17150
9703
9840
1966
16742
9839
7757
2248
11383
15127
1532
18001
2001
17657
14642
5655
4904
15742
4595
16338
4695
13551
9557
10941
8626
1336
9128
12235
13180
12496
5202
12078
18344
8336
4523
6447
13527
18071
2173
20918
3749
7092
7087
8346
6202
1083
4179
13414
219
8464
4868
5000
13986
4567
16945
11623
4039
10381
17888
2668
11585
2479
4347
12289
17378
4909
12009
13430
8027
12414
9613
8575
5567
7426
18446
698
3856
6740
11124
16809
18776
18884
16168
1153
7449
13571
20456
5803
19976
9204
2542
7049
19430
9073
3450
13112
6505
2851
9757
2771
17772
12834
2993
4649
21061
11338
15603
15950
8425
9199
19937
21082
5944
20725
10931
12238
592
5544
16069
19279
2264
13773
20526
6241
20830
7813
7421
11814
19325
14161
8356
17221
18062
14110
9947
2950
10976
15581
4369
20432
3711
7239
12404
2970
5427
1760
4779
16337
9374
15158
17120
15167
12955
100
13779
11941
993
12493
9586
8689
5928
13396
21091
4386
6380
11713
12982
18152
3886
8697
4544
6436
2456
7198
20878
19227
9592
15783
19063
3891
13598
5560
20060
3828
329
17930
16972
4442
16618
2842
18304
4723
9158
9183
4293
11661
8134
1590
4961
13982
7238
19908
2006
20048
4056
8202
10050
5951
20323
17580
19722
14664
16416
11314
9711
15307
14322
11188
9587
9108
5941
11784
7062
12260
11767
2168
21144
11801
20724
9758
15595
333
1399
16388
15240
2671
19816
14607
12424
20715
3271
15442
3350
378
10292
20315
19753
13786
8231
20743
981
10084
15135
11749
17104
1425
17960
6722
2329
2220
14999
16250
11261
8900
13790
9165
13289
13173
13905
247
17493
7841
14078
14956
16040
6939
2396
7496
13248
1178
1553
7272
12049
17736
9594
14603
15543
10196
5480
9737
13240
16191
7986
1550
15998
55
2351
14845
8688
4732
11928
8801
11123
13607
17729
5026
13024
16332
16237
8946
13361
13225
2022
18175
4741
11835
8090
262
9281
5419
16405
442
17076
12206
19659
7552
12114
7005
15348
7095
2649
18414
13704
16060
3510
19605
5265
12037
15923
18862
7838
16475
14887
552
5421
10085
9512
8305
1031
12392
17499
14192
9726
3529
1971
20458
6144
2776
20658
6554
16379
10213
1857
8445
13675
12112
7207
3623
7172
1110
11332
19627
18849
2249
16829
16780
6124
8313
8405
16504
6331
14115
20784
8731
15688
19633
4631
4013
2545
20380
3376
19277
7116
18907
7364
18305
6437
4173
3756
780
14930
12227
18353
15259
3554
20587
13132
12616
15996
14509
2207
11883
6386
3431
3541
2145
17390
903
2420
16309
17264
3273
19748
9922
5416
4041
19615
15670
10527
6465
4974
17779
14128
17818
15138
6318
14133
15288
13168
9136
19071
1612
3069
5325
13067
13548
6326
3393
19342
12972
5769
2163
15185
18276
16621
9714
12916
11684
10033
1166
20118
17437
10015
6382
8576
7644
11324
15533
14969
20614
17474
6549
19338
11406
19787
3965
12105
2850
9544
11443
11246
13501
10815
8852
19564
1257
1202
4110
19873
717
20053
1020
2053
19398
6377
19717
1397
2496
13610
18913
5201
15723
16455
3351
5924
17042
15036
16810
18177
7108
17583
4883
11134
6912
18297
434
6288
4867
17940
18388
9783
5602
7179
12199
14245
14427
6909
19284
7920
10528
3577
14609
2885
15252
6913
17887
19055
800
15654
1469
18441
942
10243
17034
21194
12232
4744
17481
7212
3522
697
8753
17845
2897
3414
10380
20731
20540
18793
7247
932
1664
16866
1507
13058
10393
11371
3288
1984
1390
17464
9615
13667
7774
3244
20497
18916
998
20219
10403
8913
584
2318
13624
16675
11586
16477
19330
1021
16878
821
18180
4153
14238
18757
17833
4854
1275
13086
583
5694
20793
11530
3983
2793
3913
13706
19361
12874
1160
17847
2972
12288
13755
2766
3601
15151
16775
9525
19192
3657
16281
9061
14899
3142
13429
12328
5875
16109
3851
10202
17397
8591
3197
21174
20204
3612
19619
9575
8423
1767
5882
5023
16512
18605
18220
16751
8803
14157
6410
8409
19208
5246
12115
4914
8396
7899
18817
12520
16804
1381
12369
16437
17518
11804
18204
3017
3701
863
2648
11473
10108
5605
695
1655
3963
3417
6044
3589
19594
17466
10936
4144
16236
12950
6545
19765
15672
14267
12663
13217
19054
20528
5755
9541
3347
10447
15750
18331
6666
19890
10971
1587
18082
20019
11805
19715
3368
10440
19196
18413
8947
5650
4371
10685
765
10110
473
1497
4938
10073
16520
4642
3456
17562
15479
17457
7133
17651
4827
10361
1132
4213
18892
15937
4887
11328
17199
711
10039
19700
628
1045
16263
4140
16075
2708
15931
18676
20530
13106
16505
12448
6066
4309
5059
1542
19961
11943
2362
200
12524
18685
6661
8050
19440
8193
15521
13865
5894
11944
7196
2326
15432
6400
287
16708
2254
7531
5689
5248
13588
19435
2910
14207
1009
19788
3682
19974
18813
11764
19172
8309
3280
9555
20123
12946
3845
2062
18671
1097
10000
16926
10657
4407
13868
7419
1977
18731
4236
16677
11449
15629
21007
9632
7132
5233
290
10879
17908
8558
10700
7705
12095
2365
10386
4033
6778
7110
10022
2325
8709
11334
14143
18009
17906
1448
14086
4796
13833
10165
13631
17856
12755
7036
16262
4598
15941
12498
7857
11435
12271
6980
7620
4896
12138
14557
7074
8328
20545
18465
11771
20254
5674
5524
6582
855
18823
7707
20565
7583
7025
17083
14289
11839
19179
18384
20747
1069
15772
3418
5151
10770
19547
16966
11592
15343
15520
6982
7956
16220
17711
19390
1351
2065
15904
10796
10235
5507
1927
11783
18181
5735
11207
21197
2497
2233
7592
6149
4062
11044
14937
19638
3169
6677
19479
12949
5800
11803
11447
13294
12585
15529
9406
12598
15123
1468
19797
12611
1560
19536
9881
19643
20336
7922
1129
20759
20748
4405
476
16389
5682
19759
16183
943
1472
12292
10320
14667
2808
4681
13255
19217
17002
2226
20214
8720
12947
17950
8203
1008
965
13804
15354
11115
10242
2700
4542
8888
8386
1330
20961
394
2963
18712
10787
13252
19347
8779
13000
1841
732
12406
6550
19567
14692
17425
20755
10595
2049
1783
4175
5763
6470
6828
15336
20946
2386
17465
17041
12958
7715
20177
212
20595
7966
5799
10564
9650
4648
1243
16755
5139
8570
11080
7349
20092
4873
14550
1686
21071
11006
20042
14312
3582
19716
4191
19993
18931
11997
20571
7960
6207
3610
11175
8471
18674
10729
18990
15575
12261
4950
9480
91
13326
10789
15344
9782
20009
11444
16670
21148
4093
3452
15845
5970
15795
3605
5698
10492
9171
13122
3413
1331
18169
12988
2081
8532
19896
20825
19965
15871
5511
17681
2008
11061
2886
2593
715
14787
9808
395
10308
6964
4609
3079
8874
15602
5288
2471
5759
12285
253
14761
1501
6226
747
3021
8333
20967
16669
9302
4901
19667
10130
12984
16099
12410
3585
16784
7567
20998
18320
986
13963
20480
17533
14882
17317
5673
17439
7456
15230
14188
9812
17867
13679
12268
7706
9547
13304
51
4820
1942
9695
2569
15329
13560
16122
724
12774
1318
15557
14102
3784
8790
11797
12237
20741
20027
5632
18324
10012
14039
8302
9607
1906
6744
3903
19901
11703
2366
1606
4725
8787
13775
950
793
11253
17706
14344
13970
3185
2848
15749
19492
5588
10398
10627
10013
7933
20902
9767
14731
11913
5822
2393
17310
9654
14646
14878
4465
3379
15406
1407
15748
7656
13825
3133
8977
14163
19392
10362
17955
7989
14420
7819
18794
9570
11612
18367
2287
5313
6842
15384
3199
12460
16142
21020
921
4769
518
16996
15077
2148
19651
17760
12587
10126
11206
9021
4444
12137
1314
3511
5168
544
10741
1635
10652
20500
19680
15215
6732
10660
17444
11222
5399
7907
1608
6285
5782
7162
2987
14202
16135
714
17151
8484
12508
11632
9597
13575
18937
12672
17197
7053
18974
9995
5497
4378
623
16177
18839
9381
4379
6887
16974
4239
13506
3950
414
844
10418
133
13767
18899
13538
6571
14326
10304
7398
13100
18744
4501
5916
1796
7730
2632
5099
17642
627
19489
17453
557
8880
16154
6584
38
7303
12472
12396
15707
8103
19786
830
10634
20683
15764
8394
6532
16683
1173
3191
8561
692
2281
16782
21016
19979
15762
2214
8036
5802
7848
12186
14433
1647
10849
4184
7406
11069
17469
15759
2969
9486
9894
9883
8049
2811
11025
13052
17443
15196
20193
14602
14450
9794
18689
18614
7574
20677
4497
6907
16419
16042
10739
10689
14908
16876
3830
6789
17128
295
12632
15150
10143
19964
15828
17449
7930
20814
16036
8130
1108
9798
786
8370
18040
1774
18675
1326
4272
11715
13688
10630
2330
3987
4335
11489
17805
5569
17674
14079
20688
17949
10961
18484
12847
3915
2521
16127
12371
6060
16666
3491
15722
179
3232
319
14209
14533
19166
18105
9733
11916
5346
13234
4196
17161
14653
8038
19082
17293
1121
2367
2959
16717
9827
14284
11573
15813
6342
9094
9662
7837
768
5778
7299
10975
13718
1900
4540
15031
6185
17222
9963
20274
7725
914
7523
17271
8055
16576
12197
19864
8325
12083
20022
5686
5009
13749
19046
10187
2399
1
3867
4479
10125
9619
4448
4423
3493
10982
18186
12593
2246
877
17294
839
7525
18568
20454
18080
16891
16998
19395
9897
8568
11533
14707
18061
20468
1868
5750
1305
5636
6626
16856
11396
12729
177
18381
15466
12669
5272
20863
17798
4615
18107
13590
13208
846
11293
20903
10898
13330
18878
12365
2331
4353
10461
700
15699
19914
12803
5054
9109
17790
16457
11453
17170
4531
9329
14654
17089
16985
3180
2018
10487
18087
6872
13485
1628
20521
9424
21222
2373
6278
9018
6647
7206
1603
4758
7435
16631
1369
6811
11239
5541
5693
20109
5352
13314
16454
12307
12922
19508
12718
16802
1037
7925
18474
9473
4951
13422
14687
16054
139
9427
99
9606
18233
18620
7500
11789
4358
15875
5096
9935
4468
13827
19125
12710
16637
13146
19469
13829
9640
17617
5963
10008
13307
11400
5933
12839
16430
11434
3093
955
20075
15767
7193
20488
8242
17109
12630
10291
4619
7850
14040
11970
20379
9434
18392
18003
20726
18370
2020
8891
10241
19316
14457
16912
2267
20137
20888
13975
13420
16241
20099
9958
1506
14417
517
8353
9118
8269
15668
6728
5235
14166
6746
17816
18780
601
14625
4054
14585
14554
9786
6954
3533
10271
16849
17067
6771
20032
19947
20727
18538
14721
13988
16227
14274
18397
2617
6509
18158
9730
7726
17091
11347
15690
10094
18317
2552
14054
15017
2737
16374
18139
5462
2183
16948
15286
6229
7576
11479
8799
13460
8033
18606
14844
7556
21023
8915
6825
11678
8714
4458
17462
14942
10702
19382
6960
19095
8238
16049
9048
9522
6916
14406
893
20916
2698
20505
18372
5019
7893
5957
2770
10754
20642
16479
1198
11794
3466
14279
1167
12708
5618
11969
9743
6309
3884
7047
15324
6206
4573
1676
9763
18660
547
16976
16969
20934
10735
4976
6570
9898
20283
11056
10572
14113
1394
13792
3868
10742
16965
8524
12898
2240
15979
17643
19062
209
18229
18015
281
13209
15395
17505
14578
61
9558
10889
8234
1747
17288
6548
895
15452
15035
13605
17648
10772
18589
1273
9105
5553
5780
2472
2890
18049
6645
15583
12668
17999
4955
2915
11872
5295
14147
10538
1391
3990
11818
3380
19904
8197
6562
14382
8023
5
2841
1299
16453
3794
18919
69
20625
16312
20516
17101
4090
9842
2732
5215
17895
4708
1252
3739
18395
20738
11777
8633
14992
5996
12254
5727
5853
3319
7818
12052
9008
1389
8150
1775
7158
13418
13007
3162
15174
5455
4133
9141
3762
7113
14372
20588
17621
5087
15867
1833
17796
8298
4294
13448
8974
4424
6223
17800
7086
17682
18583
11458
2417
19959
20054
5348
1757
20262
3027
4102
9968
4601
18078
13483
8855
15313
9320
5504
3709
13659
13287
14757
16120
135
10562
15376
12904
20014
17008
7655
17252
9014
1321
18686
3526
12661
17799
10270
18110
278
5047
7888
2869
6156
6795
17640
1856
9582
9169
20593
14441
6171
12989
8725
5805
16528
5858
18835
1231
18102
18285
16838
9340
14596
108
8135
1338
19755
3778
4344
13154
10198
19955
13762
2754
14893
19257
19670
18438
2794
11058
3451
13572
17283
11526
15861
2415
13726
13375
7769
2251
20266
11217
19499
16480
5088
4849
3453
3183
8014
7412
19998
8938
8685
869
7772
16231
8080
14914
217
18121
12126
20231
8750
20860
16654
13910
3186
20343
18194
8194
4966
16102
19001
8186
6717
387
18437
900
7175
13683
12545
13666
20317
6432
17822
6304
2374
8318
13305
17330
10412
10070
7167
511
7460
9415
537
11271
17582
15924
1453
4549
5979
6925
156
20259
19552
14592
3959
13395
4560
2231
15360
14545
3301
11733
20140
20670
5073
5577
9239
723
818
151
1335
18911
8723
12154
16314
19774
19903
16313
432
5753
11862
12886
13950
26
7585
16186
460
4973
9100
3548
5635
10757
9450
13446
2375
16272
20933
1111
12534
21171
18160
14919
17297
17824
3880
8662
4488
9583
12403
19494
14571
13069
1088
9793
20904
9872
20762
14848
11904
5327
16597
19561
20459
20600
16676
2646
14605
4673
10534
11911
15744
18773
5563
6276
17074
77
1768
2927
74
13261
8652
3719
4892
8440
12749
9878
10709
1223
3869
5453
21068
15319
1100
7690
6706
10484
18648
4512
6428
19455
8494
7147
7676
12578
15401
18619
12966
12399
14638
9166
3189
19940
2978
1494
5275
5358
1471
15528
5345
12851
12600
4380
10014
10957
16959
14686
17361
7712
14231
8116
20846
2564
4712
2717
9053
8485
7044
18098
7118
2951
1631
16846
1316
5906
9873
8980
16549
1148
20205
11644
14129
1271
16311
753
13109
6944
2450
19281
1216
7145
7366
8763
3814
3497
19812
12753
18804
862
10310
10327
3617
758
17827
6933
20805
8746
11016
20832
18952
3205
15418
6777
6924
11193
4746
9330
3528
19521
1917
328
12858
10759
3788
6145
9260
16968
15990
16342
128
11927
13486
19300
4100
3893
9288
2205
832
2746
19332
12977
10294
4263
7778
13636
18960
1080
712
9283
3302
206
16730
4510
16456
12590
983
606
6681
7291
3338
16473
3774
6187
11480
5403
17900
9064
20396
8253
12034
20291
16383
20802
6445
12985
10366
16433
4118
14250
16932
8176
4015
3625
10240
14499
9280
4500
20531
13119
4802
14881
199
5513
7670
8184
13713
802
19412
15471
7161
3299
13327
5625
17709
19926
19161
5411
6299
18362
4028
13604
11701
267
18026
15278
21214
146
2447
17374
18883
8937
4142
14270
17781
19303
20685
4114
13229
2599
18008
18235
9347
16901
15399
14409
13083
6312
1224
6882
9731
19546
9308
602
18962
6786
5431
18789
21094
9337
2185
11099
9848
16100
15693
20244
20789
15999
19869
2831
1596
13619
16935
7794
15916
20957
19900
1301
1619
1070
8481
3323
14701
4633
8507
20568
8235
5890
6826
2010
6039
12370
5534
15107
7597
12711
2280
12168
4109
14562
5486
5976
14655
5728
9851
10330
9230
2131
7250
18664
16700
408
2268
19033
2670
7487
1054
9913
8018
11961
2719
4301
224
16616
8162
20448
2931
49
9623
10488
12702
2078
7237
57
7201
9584
14606
12867
19146
17477
18896
20399
6097
15310
9214
9580
18193
3887
13264
10041
15774
9464
4456
11228
8894
5353
8733
9561
21012
15455
4487
9909
17598
21018
1956
1172
7277
9967
14196
5943
17212
20657
18374
13893
1082
5374
8326
14647
13478
18352
2619
13534
20282
556
5183
16421
7729
8501
14165
7916
20417
18286
18259
5472
16155
21083
17460
6363
18303
8573
1597
12739
6914
15571
20947
2422
20163
2778
1589
13803
14210
6938
5446
7760
784
9715
20245
8678
4206
9210
492
10414
1706
17072
449
9976
20936
14841
1751
18923
2334
19120
18848
14837
14380
1072
180
5211
16667
4304
987
0
15754
13462
6652
4670
13063
17415
1583
10619
4340
1748
20843
6199
20923
10347
12556
20045
2704
14534
18200
4811
13441
11636
10765
1096
9254
16614
4186
1680
18155
11709
10782
5775
3684
13118
13456
14304
8562
8224
2592
13857
9622
3593
7257
826
1078
4068
2921
385
19579
20501
4485
11336
16204
19234
15669
16080
502
6224
6430
1852
1062
12741
20475
1293
3022
5936
11057
11079
6289
8928
11531
12845
13187
17093
6870
18734
9088
12394
6148
3854
19456
2896
11279
11355
1965
14458
5558
11000
82
17557
663
16085
12547
18824
18447
6253
9920
2077
10161
19606
17962
4176
17359
17498
16558
4280
9156
19804
5876
11826
9315
2976
14055
18014
16868
18652
5172
8695
15334
886
10863
9689
17792
9760
9012
1735
16967
14555
12471
3364
854
3424
12563
20513
10056
17269
16541
15300
10649
7785
5468
2663
2119
5958
6394
9969
1509
18865
18254
17739
1445
8757
8592
17284
12091
5641
17356
19584
629
8478
18076
19023
13198
7939
8819
6132
10736
5210
13934
21002
616
14990
19686
9579
8281
1002
7038
8924
2925
106
5280
10518
21164
7298
11936
12602
19009
6663
14244
12659
20313
14261
12190
4120
6879
6600
6373
2705
464
19548
11027
14985
15488
1764
18695
4438
16899
6708
17653
11108
16038
1991
13176
8381
16406
20412
2583
19915
7230
18905
11167
2908
19879
8091
7127
16862
20330
5611
4461
2840
10672
5200
185
1537
6977
13457
14948
5025
11386
12442
10250
16579
7780
20460
9305
20663
16348
16854
11497
12256
18314
12339
5032
1412
16370
17178
4562
18802
5271
3740
18604
17662
527
14863
1260
1515
7509
8641
16009
13117
450
6322
16758
15238
10817
15891
3103
2753
20742
1040
6575
17935
12412
5475
13491
17290
1534
8
19746
4434
1808
2038
8539
16315
17026
4319
2665
12400
2123
16745
18302
9677
3367
4178
4230
17393
2711
14094
9284
4492
12349
7560
1170
14608
6251
15171
7867
11730
1296
1629
14936
9988
2257
5324
12789
21111
1963
17858
1559
595
20745
9636
17961
8706
3968
12356
12555
13793
8285
19777
11660
5888
15751
19175
9042
19829
20300
3300
15675
3669
14434
19620
9470
8284
15878
8261
14268
18281
3092
1419
16252
9823
9098
2797
11729
21104
20893
4226
5081
19858
400
5931
16929
3225
1821
21050
1312
20280
16059
14962
10918
12469
5036
5589
9206
11197
14630
14802
19905
17029
1004
5628
4554
19636
306
8851
17139
13633
5393
6701
13637
4432
6985
20361
8738
14727
12466
3931
12726
4284
4275
4991
3217
12162
6245
17525
7052
5189
20708
1428
5389
3464
3799
4817
18407
17515
15433
11470
14354
17319
19813
10279
14783
6426
21019
19102
19570
9822
12367
8112
13046
1712
323
5835
16911
4860
6498
8754
10485
2024
9626
18545
12426
17974
15241
1161
4834
11739
19501
19640
9599
13673
14559
18054
14213
11548
11550
6618
20407
3553
399
7278
3686
12594
5774
13344
12026
11987
9641
9937
20
20824
6695
21075
1907
17581
3735
13017
13033
13743
4365
12395
19629
19016
13045
15426
7839
19098
18661
14912
241
807
11620
13591
8032
19025
17183
2810
12388
6035
20636
3455
4972
14857
1702
9528
9159
19294
3080
5028
9598
95
8324
4095
618
2615
1891
18636
3412
4413
8493
8687
17755
9697
4662
9087
12798
6434
16472
15254
7314
15059
14347
12463
15623
16134
4515
5083
2519
15796
11963
15231
18258
7632
10481
17116
14514
7711
10874
16381
14580
14918
14052
3184
13492
3542
1930
2786
6210
12927
17207
2907
7184
20287
13740
14621
15633
10722
16801
2506
20363
21128
6770
239
4616
9502
17730
14376
2533
17668
4671
20899
4714
16293
16595
5109
8653
293
15363
6823
9222
11492
12915
1377
14847
20149
10791
5920
2752
10457
15833
16865
19621
9000
10512
7882
17005
4772
9174
2368
14852
18288
4992
11968
587
14970
19165
3984
16657
15781
9435
4831
18112
15862
4761
376
10568
8212
14542
3234
3644
20424
8043
16826
9277
12175
3073
9799
4224
6703
393
2788
18950
16584
14120
12475
8921
15638
14136
10642
19971
9217
3865
21208
5869
14876
2011
3094
2981
5508
4135
13898
20031
15708
8893
7919
3463
4949
6483
8451
19660
13847
19258
10325
11761
20257
7777
10197
12120
1279
7300
20061
14834
6877
19127
7673
11041
20438
10992
19365
410
20628
12013
3112
16947
8427
10106
3330
19139
5226
12375
624
1238
3208
3683
19160
20226
13385
4159
12704
4784
18956
16555
14411
5717
17010
18033
9756
20671
17035
7389
6999
4221
13108
15393
16803
17347
17588
10375
898
17784
20281
3708
10382
8934
7083
7187
5321
9292
13941
9402
5500
15920
12880
4215
17157
19114
7359
7146
18692
16492
12961
12775
20788
21109
6898
2601
3336
2565
3259
20575
18123
17959
18786
6886
19323
18983
15100
6930
8778
17723
18198
14217
7111
14201
960
17281
15420
5609
10728
10989
4326
2743
11544
13879
4651
12239
4916
12504
18836
485
6196
3827
3224
16172
10552
2792
14182
1374
594
10086
2096
1487
8739
20387
8341
17385
19204
2920
2630
4771
354
6458
1651
20428
17869
11622
18742
20637
20320
9037
1411
2999
3626
6053
11491
4494
7310
17751
13723
15365
1993
3945
8587
752
13031
3598
13364
9318
16502
9849
20230
3071
8506
19345
6080
17970
17403
2133
3573
9353
18245
8520
15827
7264
11791
1168
16165
2262
4957
20366
19754
12513
7225
15847
9121
2333
5263
17418
1071
15884
12617
13518
7999
1495
6134
12620
11361
9137
14307
6137
5590
11780
8973
7190
5859
13415
19653
10201
6926
3057
19852
10005
1103
11890
9452
8012
4273
15911
14056
13166
9493
7936
12924
5643
18709
10417
19675
12377
10138
11515
12255
10703
15611
2294
8500
4162
7106
8187
17312
9509
4181
18073
7796
2034
9974
19837
7809
8553
248
20079
13029
6064
7799
14582
5467
6546
4366
2809
1403
7826
5039
19845
651
1138
13470
14487
19019
20238
4460
12633
5777
994
5860
2193
13976
16377
93
21150
20335
4351
18408
8148
1159
7270
7506
8955
7400
581
14634
12467
13306
13507
15194
17718
36
16682
10663
8732
18811
4428
14423
6910
1446
13745
11788
9107
15798
8019
18210
19831
10370
11043
15829
18472
621
20928
18202
18275
18162
10429
17129
15394
13851
1095
6729
4161
14923
3930
12742
5715
13128
15132
20566
1853
21207
15791
5804
14253
14871
6866
257
6049
11376
12258
6239
694
892
12277
5917
6324
16537
15978
13814
8508
5645
2858
9017
19386
4996
16484
19665
16448
7665
17234
11869
18582
18526
7709
20016
14569
1007
8651
19215
3523
1595
10059
12218
13369
14681
6776
19848
17033
8287
12244
14651
19726
15640
1643
16526
15689
2058
3410
17528
12597
8489
2799
13499
936
3737
8650
20067
21037
19182
14396
5244
4
505
6366
15671
16169
7155
8059
12722
1947
13946
18667
8550
11498
709
18267
11848
7948
3127
12693
4254
20490
9025
20304
15720
9491
6676
12042
54
19040
17065
8338
16553
15547
15309
2208
113
10670
9256
17610
2126
6284
4074
4596
15080
7067
19283
20990
5986
8905
1429
4252
18729
2484
19041
4915
6590
12800
6475
11561
3614
6890
10671
16674
14732
1846
13055
11102
3311
9994
2982
4590
8455
2729
19973
11011
14867
2040
14729
18741
19421
2387
11322
16763
20385
11697
15614
307
9147
3933
4579
4486
10390
10859
11762
14124
952
9029
14255
3578
20098
10460
12247
19297
1038
14886
20114
12016
9542
12575
5895
6800
20485
12641
8744
3147
18064
3998
7301
15868
7832
11639
1882
4482
5176
8926
9086
12008
13266
13259
15440
7732
7619
17852
18209
15053
6120
706
15302
16698
13014
2824
9991
4287
12438
2744
7978
10444
11522
19821
16011
15470
7424
13081
6824
5149
15099
20465
19159
7540
2829
11171
6233
16107
4477
6407
8751
7996
13351
18287
94
4255
6597
14855
7054
16196
5938
1215
13066
6869
8967
2389
16267
11692
15874
6566
17902
1761
7356
1384
1814
6987
2348
18431
16039
18124
8517
16542
2342
3530
4530
6328
5801
14351
10946
2210
13281
11095
11861
121
6392
4721
10175
3761
6068
11508
12338
3813
12391
2870
6404
2871
17344
18190
81
12464
5862
2878
10990
20305
3047
18784
1762
13734
17884
14216
9992
14389
126
5681
20638
9508
19496
11382
9832
18291
6581
15130
8274
15779
11841
15844
10958
2401
16216
5062
1830
4199
2852
15043
17186
7399
4763
13697
7668
9409
4889
937
21124
11591
17765
15637
17996
19917
15713
9133
14805
14068
5570
831
3918
3062
10904
20773
5243
11855
17254
9972
1027
15277
2611
15142
11652
16655
409
11827
8398
20469
8997
17777
13096
12231
7514
15843
1400
6629
6968
5844
19123
8448
14272
14719
5496
10262
1954
17924
9628
13971
925
11823
8362
5603
2221
3146
3932
20554
8011
2574
11754
6490
10103
20749
10009
1569
12592
3213
7782
10731
1409
15685
2301
11053
7139
5669
1475
5852
1109
16006
6027
13159
4249
6412
12
20656
13953
579
9033
3363
4906
12970
18939
18995
5952
14905
1804
19991
4537
17127
1740
8644
4557
5487
19927
3632
11615
16035
18081
14445
4736
16171
8972
16790
16361
9157
7056
9134
15925
4049
17155
17388
11420
12891
2244
3190
20169
15735
2803
12402
17386
2577
18199
4591
10594
14063
8330
20927
16322
2508
12366
15793
20862
216
17947
11494
20834
19509
18283
13073
3065
2891
12715
6714
18391
8412
13318
24
3193
3779
7236
930
15592
19739
14678
13454
4339
2307
2114
13278
8317
16095
11151
10406
9854
4082
6013
20757
15351
8141
6511
3569
17812
7367
6624
19796
17447
8456
10471
10397
17044
20514
11488
12552
20721
10459
8029
2635
18772
1438
16330
20131
13952
15133
10355
11107
7186
6127
9411
20097
8860
6798
2654
18311
7192
6689
2662
14324
17759
16097
7981
6738
19893
15942
8492
2350
19885
50
4447
3773
17473
17815
5764
1311
3373
2591
7057
3642
5571
1228
336
19250
6901
7080
10747
1174
1781
15325
5070
761
17097
10186
12615
11033
10149
9949
17381
10938
20590
6832
5581
19346
15657
15251
19327
6534
10376
9249
4436
10182
14629
2580
2919
3292
13513
10007
3202
14219
8468
3753
6847
4238
12025
1432
736
12230
21198
10501
10337
12348
1890
13078
5424
18737
3348
762
19943
382
18769
16057
12761
170daguan_languagemodel_corpus47
7505
4076
19526
477
4336
13175
8759
1131
21051
11104
11510
7894
11296
11792
14510
11046
10850
17414
4046
6431
16832
8083
4439
8160
14016
3576
10963
3005
12040
19124
10341
9482
12295
13426
9385
12981
9003
15892
3329
13691
16164
3423
13768
12149
14986
5683
10812
12021
13782
10911
1348
118
1193
1746
3964
11833
16867
6234
14594
12937
20774
8700
12965
17110
1441
16359
15540
18690
18334
1322
16108
9581
3407
1811
7114
7568
14084
5896
4328
3083
17006
3558
12161
2080
13290
16026
17392
4578
19942
16582
13613
16426
6415
8288
10087
17513
7783
9358
16833
18683
52
18296
14649
4018
10691
19231
12180
10433
15275
19502
9466
17967
21163
6513
12596
21156
14823
11981
14395
18174
7591
6725
8545
1328
5413
4994
364
4921
10124
459
19938
12760
15088
2992
14013
16296
9720
18855
1333
2782
18145
2391
7000
14239
13938
19985
5817
17769
8559
14989
1269
18385
10502
749
13039
1005
8548
10215
6662
9119
18598
3151
249
6325
1440
8472
8002
669
10924
4520
8462
20439
16659
20996
4535
5528
8809
8260
729
9252
5206
5517
17823
10978
10922
9392
5171
17905
9668
20159
19528
11624
18525
646
4897
12766
8174
548
1639
19648
5945
8407
11475
10801
13047
4552
19247
7328
20308
15280
9215
9212
4198
9532
9604
3294
4262
398
1137
1125
2095
7171
4729
3042
19859
17995
3832
15989
18335
20083
20165
18929
3477
6668
16471
2699
9749
17382
3137
17324
11130
3031
6519
5075
2590
1244
17358
20858
841
15056
5565
571
13068
19349
17266
9834
5194
16124
18271
15303
20008
20705
14927
12309
5710
12899
435
13302
17658
15831
16922
7286
18053
13272
16552
15545
17240
20684
478
635
11321
10119
20732
122
13911
19794
18908
10821
6205
819
14295
18167
19295
13
14294
15620
3637
16919
18787
15577
17917
20543
16128
1863
13738
12045
14615
1859
20360
16607
2033
15209
2862
9572
5155
2735
1386
13010
13191
4527
19953
20202
13135
20751
12136
18183
10004
19825
18159
17946
20011
8607
19131
16601
15206
2012
5273
20833
4260
15883
17958
10297
